app/Http/Controllers/ActivityController.php

    public function getActivityUnits($id) {
        try{
            $units = Activity::find($id)->units;
---
select * from "activities" where "activities"."id" = '1' and "activities"."deleted_at" is null limit 1