app/Http/Controllers/ActivityController.php

    public function getActivities()
    {
        $activities = Activity::all();
---
select * from "activities" where "activities"."deleted_at" is null

    private function getUsersForSelect($subscribers){

        $sub = array();

        foreach ($subscribers as $subscriber)
            array_push($sub,  $subscriber->id);

        return User::whereNotIn('id', $sub)->get();
---
select * from "users" where "id" not in (1) and "users"."deleted_at" is null