app/Http/Controllers/DashboardController.php

    public function newDashboard()
    {
        $all_activities = Activity::where('id_author', Auth::user()->id)->get();
        $reg_activities = User::find(Auth::user()->id)->activities;
        $all_events = Event::where('id_users', Auth::user()->id)->get();
        $non_validated_activities = Activity::where('validated', false)->get();
---
select * from "activities" where "id_author" = 3 and "activities"."deleted_at" is null
select * from "users" where "users"."id" = 3 and "users"."deleted_at" is null limit 1
select * from "events" where "id_users" = 3 and "events"."deleted_at" is null
select * from "activities" where "validated" = 0 and "activities"."deleted_at" is null