app/Http/Controllers/TestController.php

    public function getTest($id)
    {
        $unit = new Unit();
        $option = new Option();
        $events = $unit->find($id)->events()->get();

        $eventArray = [];

        foreach ($events as $event) {
            $options = $option::inRandomOrder()->where('id_events', $event->id)->get();
            $helps = Help::where('id_events',$event->id)->get();
---
select * from "units" where "units"."id" = '6' and "units"."deleted_at" is null limit 1
select * from "options" where "id_events" = 12 and "options"."deleted_at" is null order by RANDOM()
select * from "helps" where "id_events" = 12 and "helps"."deleted_at" is null

    public function run($id)
    {
        if (Unit::find($id))
---
select * from "units" where "units"."id" = '6' and "units"."deleted_at" is null limit 1

    public function show()
    {
        $tests = Unit::all();
---
select * from "units" where "units"."deleted_at" is null